content/posts/emacs_hyper_notebook.md
+++
title = "Emacs Hyper Notebook"
author = ["Joe Corneli"]
lastmod = 2020-09-12T21:07:38+01:00
slug = "emacs_hyper_notebook"
draft = false
+++

We are developing a better way to do “Jupyter notebooks” using Emacs.
This recovers some of the Research Collab ideas developed by Aaron
Krowne. It should integrate features such as writing and task
management (e.g., _Org_) Program evaluation (e.g., _Maxima_),
Typesetting and presentation (e.g., slides via _LaTeX_), and
navigation (e.g., _Org Roam_ for displaying topics as a graph).  We
should be clear that the various technologies used are slot-fillers
and they might be replaced with other things, or augmented (e.g.,
_Lean_ for formal verification of some of the above?). A useful input
to this process would be implementation of examples without
integration.  This can then be redone in a more integrated fashion.

An integration using existing technologies will have limitations, once
we have this demos then we will see some of the gaps and how more
advanced tech could be useful. (For example, Ray’s work with Gerschom
could turn out to be useful here.)


## Partial prototypes {#partial-prototypes}

How far can we go...

-   Through Roam? (Talk to Connor about Roam on Twitter?)
-   Through Jupyter?
-   [Foam?](https://foambubble.github.io/foam/) [Glamorous Toolkit?](https://gtoolkit.com/)

Can we integrate it with existing tools?  Do Lenses help with this?
Would it play a role as a backend system?


## Links to useful resources {#links-to-useful-resources}

-   [exp2exp/notebooks: This is a Docker configuration for running jupyter with multiple kernels on Arch Linux.](https://github.com/exp2exp/notebooks)
-   [emacsclient Options - GNU Emacs Manual](https://www.gnu.org/software/emacs/manual/html%5Fnode/emacs/emacsclient-Options.html)
-   [butlerx/wetty: Terminal in browser over http/https. (Ajaxterm/Anyterm alternative, but much better)](https://github.com/butlerx/wetty)
-   [xtermjs/xterm.js: A terminal for the web](https://github.com/xtermjs/xterm.js#real-world-uses)
-   <https://twitter.com/cianbutlerx>
-   [tsl0922/ttyd: Share your terminal over the web](https://github.com/tsl0922/ttyd)
-   [yudai/gotty: Share your terminal as a web application](https://github.com/yudai/gotty)
-   [butlerx/wetty - Docker Hub](https://hub.docker.com/r/butlerx/wetty)
-   [Setup Web Terminal using Wetty Docker Image | by Chairat Onyaem (Par) | Medium](https://medium.com/@pacroy/setup-web-terminal-using-wetty-docker-image-dcb1ea75bfaf)
-   [krishnasrinivas/wetty - Docker Hub](https://hub.docker.com/r/krishnasrinivas/wetty/)


## Contributes to {#contributes-to}

-   [Visual Interfaces]({{< relref "visual_interfaces" >}})
-   [Arxana 2020]({{< relref "arxana_2020" >}})


## Backlinks {#backlinks}

-   [Construct, critique, improve models]({{< relref "construct_critique_improve_models" >}})
